#+TITLE: ApiSnoop_v3 Flow
#+TODO: TODO(t) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+PROPERTY: header-args: :noweb yes
#+PROPERTY: header-args:shell+ :results output list

**** DONE Prepare this Org
     CLOSED: [2019-07-01 Mon 10:05]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 10:00]--[2019-07-01 Mon 10:04] =>  0:04
     :END:
     I want to have a basic structure that Josmar and others can follow for what I'm doing and why.
     This will grow as needed, so will not spend too long on it now.
**** DONE Add Dan's Comments to tickets in gitlab
     CLOSED: [2019-07-01 Mon 10:19]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 10:07]--[2019-07-01 Mon 10:19] =>  0:12
     :END:
     This is based off a slack convo [[https://mattermost.ii.coop/files/ihzmi3whb3d4xpssynbnh7sude/public?h=5CpNsQ9EyK3IZeHl2Ue8jdI7vD9ENx_T90EsPthuNSs][shared in mattermost]].  
     The Key Points are:
     - Arrange a call with Aaron, Brian, and Belamaric to see if automated tools like apisnoop would help.
       - [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/5][Issue 5]]
     - Get Apisnoop integrated into the beginning of every call
       - [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/6][Issue 6]]
     - Get apisnoop integrated into prow so someone can see the conformance increase for a pr.
       - [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/7][Issue 7]] 
     
    I would consider the last two to be 'discussion' issues, to figure out how we can design APISnoop for both, so I labeled them as such.  A future task will be to start the discussion here, as I got opinions on how we can do both.
**** DONE Make sure we have a starting board for the schema and server boards
     CLOSED: [2019-07-01 Mon 10:22]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 10:22]--[2019-07-01 Mon 10:22] =>  0:00
     :END:
     We've added this as part of the ticket writing.  The boards have been added to this org, under our [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/1][gitlab resource]]
**** DONE Writeup Tickets for populating this backend.
     CLOSED: [2019-07-01 Mon 10:43]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 10:25]--[2019-07-01 Mon 10:43] =>  0:18
     :END:
     Once we have a backend, it needs to have data in it.  This is a combination of schema design, and writing functions for how we post new data to the backend.  I think it is usefult o have thse outlined as single ticket,s to better track the work, and so will refine issue 1 to be an umbrella issue, and better outline the steps needed to show it's a workable backend.
     
     I've fleshed out issue 1, connecting it to all its sub-tickets.  [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/1][Check out issue 1]]
**** DONE Issue 8: Setup backend, that's tied to a db and has a graphql explorer
     CLOSED: [2019-07-01 Mon 15:52]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 14:43]-[2019-07-01 Mon 15:52] =>  1:09
     CLOCK: [2019-07-01 Mon 10:45]--[2019-07-01 Mon 11:00] =>  0:15
     :END:
     [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/8][Link to Issue 8]]
     
     The majority of this work has been done in this repo on Friday.  The work now is to be able to commit these changes to our repo and start to document how it works.
     
**** DONE Issue 9: Write a mutation for populating db with an audit log.
     CLOSED: [2019-07-01 Mon 17:42]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 15:55]--[2019-07-01 Mon 17:42] =>  1:47
     :END:
     [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/9][Link to Issue 9]]
     
     I am thinking we'l base this off the metadata.json of the audit log, since that's available from the start with the log.   So the flow will be:
- post a new auditlog, based on the schema, that contains the basic metadata.
- post new individual endpoints that have, for the auditlog value, the id of our just posted auditLog

This should allow us to have a nicely connected tables and being able to see the coverage of an endpoint over time (comparing aacross audit logs), while also setting us up nicely for the data-generation script.

I worked off the hackernews tutorial i did, simplifying and refacotring as needed.  I put in the types defined in app.org as part of our 'release metadata', but renamed release to AuditLog, as that's more accurate to what the thing is.
     
**** DONE Issue 10: Write a mutation for populating an endpoint to backend, that's connected to a release.
     CLOSED: [2019-07-01 Mon 19:16]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 18:11]--[2019-07-01 Mon 19:16] =>  1:05
     CLOCK: [2019-07-01 Mon 18:09]--[2019-07-01 Mon 18:10] =>  0:01
     CLOCK: [2019-07-01 Mon 17:50]-[2019-07-01 Mon 18:10] =>  0:20
     :END:
     [[https://gitlab.ii.coop/apisnoop/apisnoop_v3/issues/10][Link to #10]]
     I should be able to follow the path of the auditlog schema.  The tricky part here will be connecting an endpoint to a release, and how to set that up in a resolver.  I feel I can use the graphql tutorial at howtographql.com, and follow their example of a post and a user.
     
     ---
     
     This worked out smoothly, using that example.  I've set up a mutation that requires an auditLog id, it then connects to that auditlog when put in.  This means that when I query an endpoint, I can _also_ see all the info about the audit log its a part of.  when i query audit logs I automatically see all their endpoints.  It's a nice pattern, and simply implemented.

    We just need to remember in the data-gen script we'll take an audit log, and post its metadata to the db.  the db will return an ID...we then need to take that ID and use it as a variable for all the endpoints, useragents, tests, etc, we post next.  This _feels_ simple to me, and doesn't introduce anything new to how we've defined everything.  
**** DONE Update README with dev setup and use.
     CLOSED: [2019-07-01 Mon 19:54]
     :LOGBOOK:
     CLOCK: [2019-07-01 Mon 19:46]--[2019-07-01 Mon 19:54] =>  0:08
     :END:
     
**** DONE Write out tickets for getting test_tags, useragents, and tests into db.
     CLOSED: [2019-07-03 Wed 09:24]
     :LOGBOOK:
     CLOCK: [2019-07-03 Wed 09:10]--[2019-07-03 Wed 09:24] =>  0:14
     :END:
     Added tickets for 14, 15, 16, 17, 18 and added them to this flow as TODO's.
**** IN-PROGRESS #14 Write a mutation for populating tests in the db, that are connected to auditlogs and endpoints.
     :LOGBOOK:
     CLOCK: [2019-07-04 Thu 08:36]--[2019-07-04 Thu 09:02] =>  0:26
     CLOCK: [2019-07-04 Thu 05:30]--[2019-07-04 Thu 06:55] =>  1:25
     CLOCK: [2019-07-03 Wed 09:24]--[2019-07-03 Wed 11:58] =>  2:34
     :END:
     I want to make sure I can add a test for a specific auditlog, and then only connect it to endpoints that have the same auditlog.  The reasonb eing that there will be tests with the same name across auditlogs, and endpoints with the same name across auditlogs, and we need to ensure we aren't making duplicates.
    
     When I add a test, I won't know each of the endpoints id's.  I think it's well enough to match on operationID, as it should be a constant, and also auditLog.  So it's a question on whether I can do two arguments in the prisma ={ connect }= function. 

**** DONE Write Up Tickets for our new Tasks, based on [[*Notes from talk with hh][Notes from talk with hh]]  
     CLOSED: [2019-07-05 Fri 04:20]
     :LOGBOOK:
     CLOCK: [2019-07-05 Fri 03:51]--[2019-07-05 Fri 04:11] =>  0:20
     :END:
**** DONE Organize Org file with relevant links for this work
     CLOSED: [2019-07-05 Fri 04:20]
     :LOGBOOK:
     CLOCK: [2019-07-05 Fri 04:12]--[2019-07-05 Fri 04:15] =>  0:03
     :END:
     You can now find useful links within our resources: [[*Useful Links][Useful Links]] 
